_wiki/2015-07-17-lisp-or-scheme-in-general.html
---
collections: wiki
layout: post
title: Lisp or Scheme in General
date: 2015-07-17
categories: 
- lisp
- scheme
tags: 
-
author: carltonf
excerpt: general lisp/scheme entries
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Common Lisp Hyperspec</h2>
<div class="outline-text-2" id="text-1">
<p>
It's meant to be used with SLIME.
</p>

<p>
<a href="../core/7d/04/CL-HyperSpec">Offline CL-HyperSpec 7.0</a>
</p>

<p>
Downloaded from <a href="http://www.lispworks.com/documentation/common-lisp.html">http://www.lispworks.com/documentation/common-lisp.html</a>.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">The Scheme Programming Language</h2>
<div class="outline-text-2" id="text-2">
<p>
The Scheme's version of K&amp;R.
</p>

<p>
Notably, the books below can be accessed freely on web.
</p>

<ul class="org-ul">
<li>well formatted R5 standard
<a href="../core/03/0a/tspl3.chm">The Scheme programming language.3th-Edition</a>

<p>
<a href="../core/03/0a/exercises">My ongoing answers to exercises in the book</a>
</p>
</li>

<li>less formatted R6 standard
<a href="../core/7b/ce/The%20scheme%20programming%20language.Fourth%20Edition.pdf">The Scheme programming language.4th-Edition</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Hyperpolyglot: famous Lisp dialects comparisons</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="../core/76/58/Lisp: Common Lisp, Scheme, Clojure, Emacs Lisp - Hyperpolyglot.maff">Lisp: Common Lisp, Scheme, Clojure, Emacs Lisp - Hyperpolyglot.maff</a>
</p>

<p>
This is mostly a syntax level comparison, superficial but very thorough.
</p>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Lisp History</h2>
<div class="outline-text-2" id="text-4">
<p>
One of the definitive sources of Lisp history.
</p>

<p>
<a href="../core/90/86/HOPL2-Uncut-the-evolution-of-lisp.pdf">HOPL2-Uncut-the-evolution-of-lisp.pdf</a>
</p>
</div>
</div>
